# IPointCloudEngine Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPointCloudEngine Methods
IPointCloudEngine Interface See Also
---
The IPointCloudEngine type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreatePointCloudAccess | Implement this method to construct the IPointCloudAccess interface for the point cloud designated by the identifier. This method is called once during the creation of a PointCloudType. |
| Free | Revit will call this method when done using the engine. |

# See Also
IPointCloudEngine Interface
Autodesk.Revit.DB.PointClouds Namespace